In [1]:
import pandas as pd
import numpy as np

from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split

In [2]:
df=pd.read_csv("vechile_Price_Dataset.csv")
print(df)

      unnamed    Make  Engine Fuel Type  Engine HP  Engine Cylinders  \
0         479  Toyota  regular unleaded      270.0               6.0
1         480  Toyota  regular unleaded      270.0               6.0
2         481  Toyota  regular unleaded      270.0               6.0
3         482  Toyota  regular unleaded      270.0               6.0
4         483  Toyota  regular unleaded      270.0               6.0
...       ...     ...               ...        ...               ...
2107    11827  Toyota  regular unleaded      106.0               4.0
2108    11828  Toyota  regular unleaded      106.0               4.0
2109    11829  Toyota  regular unleaded      106.0               4.0
2110    11830  Toyota  regular unleaded      106.0               4.0
2111    11831  Toyota  regular unleaded      106.0               4.0

     Transmission Type      Driven_Wheels Vehicle Size  city mpg  Popularity  \
0            AUTOMATIC   rear wheel drive      Midsize        17        2031
1            AUTOMATIC   rear wheel drive      Midsize        17        2031
2            AUTOMATIC   four wheel drive      Midsize        17        2031
3            AUTOMATIC   four wheel drive      Midsize        17        2031
4            AUTOMATIC   four wheel drive      Midsize        17        2031
...                ...                ...          ...       ...         ...
2107            MANUAL  front wheel drive      Compact        30        2031
2108         AUTOMATIC  front wheel drive      Compact        30        2031
2109         AUTOMATIC  front wheel drive      Compact        30        2031
2110         AUTOMATIC  front wheel drive      Compact        30        2031
2111            MANUAL  front wheel drive      Compact        30        2031

       MSRP   Price
0     41365  450000
1     35740  450000
2     37615  450000
3     34695  450000
4     35725  450000
...     ...     ...
2107  15250  650000
2108  16375  650000
2109  17285  650000
2110  18000  650000
2111  17200  650000

[2112 rows x 12 columns]

In [3]:
print(f"Number of Rows:{df.shape[0]}\n Number of coloum:{df.shape[1]}")

Number of Rows:2112
 Number of coloum:12

In [4]:
df.head(10)

,unnamed,Make,Engine Fuel Type,Engine HP,Engine Cylinders,Transmission Type,Driven_Wheels,Vehicle Size,city mpg,Popularity,MSRP,Price
0,479,Toyota,regular unleaded,270.0,6.0,AUTOMATIC,rear wheel drive,Midsize,17,2031,41365,450000
1,480,Toyota,regular unleaded,270.0,6.0,AUTOMATIC,rear wheel drive,Midsize,17,2031,35740,450000
2,481,Toyota,regular unleaded,270.0,6.0,AUTOMATIC,four wheel drive,Midsize,17,2031,37615,450000
3,482,Toyota,regular unleaded,270.0,6.0,AUTOMATIC,four wheel drive,Midsize,17,2031,34695,450000
4,483,Toyota,regular unleaded,270.0,6.0,AUTOMATIC,four wheel drive,Midsize,17,2031,35725,450000
5,484,Toyota,regular unleaded,270.0,6.0,AUTOMATIC,four wheel drive,Midsize,17,2031,43400,450000
6,485,Toyota,regular unleaded,270.0,6.0,AUTOMATIC,rear wheel drive,Midsize,17,2031,32820,450000
7,486,Toyota,regular unleaded,270.0,6.0,AUTOMATIC,four wheel drive,Midsize,17,2031,38645,450000
8,487,Toyota,regular unleaded,270.0,6.0,AUTOMATIC,four wheel drive,Midsize,17,2031,37825,450000
9,488,Toyota,regular unleaded,270.0,6.0,AUTOMATIC,four wheel drive,Midsize,17,2031,43620,450000

In [5]:
df.tail(2)

,unnamed,Make,Engine Fuel Type,Engine HP,Engine Cylinders,Transmission Type,Driven_Wheels,Vehicle Size,city mpg,Popularity,MSRP,Price
2110,11830,Toyota,regular unleaded,106.0,4.0,AUTOMATIC,front wheel drive,Compact,30,2031,18000,650000
2111,11831,Toyota,regular unleaded,106.0,4.0,MANUAL,front wheel drive,Compact,30,2031,17200,650000

In [6]:
df.describe()

,unnamed,Engine HP,Engine Cylinders,city mpg,Popularity,MSRP,Price
count,2112.000000,2097.000000,2107.000000,2112.000000,2112.000000,2112.000000,2112.000000
mean,6319.160985,228.809728,5.421452,20.861742,3135.974432,28751.092330,460700.757576
std,3043.579479,84.932666,1.547867,9.673927,2068.232091,14041.947742,45017.828348
min,479.000000,63.000000,0.000000,11.000000,873.000000,2000.000000,450000.000000
25%,4354.750000,170.000000,4.000000,15.000000,873.000000,22582.500000,450000.000000
50%,5467.500000,210.000000,6.000000,19.000000,2031.000000,28990.000000,450000.000000
75%,9173.250000,280.000000,6.000000,24.000000,5657.000000,35097.500000,450000.000000
max,11831.000000,662.000000,12.000000,126.000000,5657.000000,149995.000000,650000.000000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2112 entries, 0 to 2111
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   unnamed            2112 non-null   int64
 1   Make               2112 non-null   object
 2   Engine Fuel Type   2112 non-null   object
 3   Engine HP          2097 non-null   float64
 4   Engine Cylinders   2107 non-null   float64
 5   Transmission Type  2112 non-null   object
 6   Driven_Wheels      2112 non-null   object
 7   Vehicle Size       2112 non-null   object
 8   city mpg           2112 non-null   int64
 9   Popularity         2112 non-null   int64
 10  MSRP               2112 non-null   int64
 11  Price              2112 non-null   int64
dtypes: float64(2), int64(5), object(5)
memory usage: 198.1+ KB

In [8]:
df.columns

Index(['unnamed', 'Make', 'Engine Fuel Type', 'Engine HP', 'Engine Cylinders',
       'Transmission Type', 'Driven_Wheels', 'Vehicle Size', 'city mpg',
       'Popularity', 'MSRP', 'Price'],
      dtype='object')

In [9]:
df.count()

unnamed              2112
Make                 2112
Engine Fuel Type     2112
Engine HP            2097
Engine Cylinders     2107
Transmission Type    2112
Driven_Wheels        2112
Vehicle Size         2112
city mpg             2112
Popularity           2112
MSRP                 2112
Price                2112
dtype: int64

In [10]:
df['Make'].unique()

array(['Toyota', 'Ford', 'Volkswagen'], dtype=object)

In [11]:
df.nunique()

unnamed              2112
Make                    3
Engine Fuel Type        6
Engine HP             110
Engine Cylinders        8
Transmission Type       4
Driven_Wheels           4
Vehicle Size            3
city mpg               35
Popularity              3
MSRP                 1592
Price                   2
dtype: int64

In [12]:
df.isnull().sum()

unnamed               0
Make                  0
Engine Fuel Type      0
Engine HP            15
Engine Cylinders      5
Transmission Type     0
Driven_Wheels         0
Vehicle Size          0
city mpg              0
Popularity            0
MSRP                  0
Price                 0
dtype: int64

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2112 entries, 0 to 2111
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   unnamed            2112 non-null   int64
 1   Make               2112 non-null   object
 2   Engine Fuel Type   2112 non-null   object
 3   Engine HP          2097 non-null   float64
 4   Engine Cylinders   2107 non-null   float64
 5   Transmission Type  2112 non-null   object
 6   Driven_Wheels      2112 non-null   object
 7   Vehicle Size       2112 non-null   object
 8   city mpg           2112 non-null   int64
 9   Popularity         2112 non-null   int64
 10  MSRP               2112 non-null   int64
 11  Price              2112 non-null   int64
dtypes: float64(2), int64(5), object(5)
memory usage: 198.1+ KB

In [14]:
df.isnull().sum()

unnamed               0
Make                  0
Engine Fuel Type      0
Engine HP            15
Engine Cylinders      5
Transmission Type     0
Driven_Wheels         0
Vehicle Size          0
city mpg              0
Popularity            0
MSRP                  0
Price                 0
dtype: int64

In [15]:
def fillNaMean(cols):
    for i in cols:
        df[i] = df[i].fillna(df[i].mean())

columns = [ 'city mpg','Popularity','MSRP']
fillNaMean(columns)

In [16]:
def fillNaMode(cols):
    for i in cols:
        df[i] = df[i].fillna(df[i].mode()[0])

columns = ['Transmission Type', 'Driven_Wheels',  'city mpg','Make','Engine HP','Popularity','MSRP','Engine Cylinders']
fillNaMode(columns)

In [17]:
df.isnull().sum()

unnamed              0
Make                 0
Engine Fuel Type     0
Engine HP            0
Engine Cylinders     0
Transmission Type    0
Driven_Wheels        0
Vehicle Size         0
city mpg             0
Popularity           0
MSRP                 0
Price                0
dtype: int64

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2112 entries, 0 to 2111
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   unnamed            2112 non-null   int64
 1   Make               2112 non-null   object
 2   Engine Fuel Type   2112 non-null   object
 3   Engine HP          2112 non-null   float64
 4   Engine Cylinders   2112 non-null   float64
 5   Transmission Type  2112 non-null   object
 6   Driven_Wheels      2112 non-null   object
 7   Vehicle Size       2112 non-null   object
 8   city mpg           2112 non-null   int64
 9   Popularity         2112 non-null   int64
 10  MSRP               2112 non-null   int64
 11  Price              2112 non-null   int64
dtypes: float64(2), int64(5), object(5)
memory usage: 198.1+ KB

In [19]:
df.drop('Engine Fuel Type', axis=1, inplace=True)
df.drop('Engine Cylinders', axis=1, inplace=True)
df.drop('city mpg', axis=1, inplace=True)
df.drop('Popularity', axis=1, inplace=True)
df.drop('MSRP', axis=1, inplace=True)
df.drop('Vehicle Size', axis=1, inplace=True)
df.drop('Driven_Wheels', axis=1, inplace=True)
df.drop('unnamed', axis=1, inplace=True)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2112 entries, 0 to 2111
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Make               2112 non-null   object
 1   Engine HP          2112 non-null   float64
 2   Transmission Type  2112 non-null   object
 3   Price              2112 non-null   int64
dtypes: float64(1), int64(1), object(2)
memory usage: 66.1+ KB

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2112 entries, 0 to 2111
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Make               2112 non-null   object
 1   Engine HP          2112 non-null   float64
 2   Transmission Type  2112 non-null   object
 3   Price              2112 non-null   int64
dtypes: float64(1), int64(1), object(2)
memory usage: 66.1+ KB

In [22]:
df['Transmission Type'].unique()

array(['AUTOMATIC', 'MANUAL', 'AUTOMATED_MANUAL', 'DIRECT_DRIVE'],
      dtype=object)

In [23]:
df_clean = df.copy()

In [24]:
def encodeCols(cols):
    for i in cols:
        temp = pd.DataFrame({i:df[i].unique()})
        data_LE = LabelEncoder()
        data_LE.fit(np.ravel(temp))
        df_clean[i] = data_LE.transform(df[i])
columns = ['Make','Transmission Type','Engine HP']
encodeCols(columns)

In [25]:
df_clean.head()

   Make  Engine HP  Transmission Type   Price
0     1         79                  1  450000
1     1         79                  1  450000
2     1         79                  1  450000
3     1         79                  1  450000
4     1         79                  1  450000

In [26]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2112 entries, 0 to 2111
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Make               2112 non-null   int32
 1   Engine HP          2112 non-null   int64
 2   Transmission Type  2112 non-null   int32
 3   Price              2112 non-null   int64
dtypes: int32(2), int64(2)
memory usage: 49.6 KB

In [27]:
df_clean.to_csv(r'cleaned-data.csv', index=False, header=True)

In [28]:
df_clean.head(2)

   Make  Engine HP  Transmission Type   Price
0     1         79                  1  450000
1     1         79                  1  450000

In [29]:
X = df_clean.iloc()[:, 0:]
y = df_clean.iloc()[:, 2]

In [30]:
# X = df_clean[['Make','Engine HP','Transmission Type']]
# y = df_clean['Price']

In [31]:
trainX, testX, trainY, testY = train_test_split(X, y, test_size=0.2, shuffle=False)

In [32]:
trainX.head(5)

   Make  Engine HP  Transmission Type   Price
0     1         79                  1  450000
1     1         79                  1  450000
2     1         79                  1  450000
3     1         79                  1  450000
4     1         79                  1  450000

In [33]:
trainY.head(2)

0    1
1    1
Name: Transmission Type, dtype: int32

In [34]:
print("TrainX:",trainX.shape)
print("TrainY:",trainY.shape)
print("TestX:",testX.shape)
print("TestY:",testY.shape)

TrainX: (1689, 4)
TrainY: (1689,)
TestX: (423, 4)
TestY: (423,)

In [35]:
import pickle
from sklearn.svm import SVC

In [36]:
model_SVC = SVC()
model_SVC.fit(trainX, trainY)

print(model_SVC)

SVC()

In [37]:
pickle.dump(model_SVC, open('model_svc.pkl', 'wb'))

In [38]:
model_svc = pickle.load(open('model_svc.pkl', 'rb'))

In [39]:
svc_predictions = model_SVC.predict(testX)

In [40]:
print(svc_predictions)

[1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1]

In [41]:
from sklearn.metrics import accuracy_score
svc_accuracy = accuracy_score(testY, svc_predictions)
print("-- Model Accuracy: ", end="")
print(round(svc_accuracy,3))

-- Model Accuracy: 0.924